{
    "mc": {
        "Aries": {
            "en": "With the Midheaven in Aries, your career path is forged in fire. You are not meant to follow in anyone's footsteps; you are here to blaze a trail of your own. You thrive in high-pressure environments where decisiveness and courage are rewarded. You are a natural-born entrepreneur, a warrior in the boardroom who is willing to take the risks others cultivate excuses to avoid. Your professional reputation is one of dynamism, speed, and fierce independence. You may struggle with authority figures because, deep down, you believe you should be the one in charge. Your best work happens when you have the autonomy to act on your instincts. Look for careers in leadership, military, sports, surgery, or pioneering tech startups where 'first mover advantage' is everything.",
            "tr": "Koç burcundaki Tepe Noktası (MC) ile kariyer yolunuz ateşten dövülmüştür. Kimsenin izinden gitmek için değil, kendi izinizi açmak için buradasınız. Kararlılığın ve cesaretin ödüllendirildiği yüksek baskılı ortamlarda gelişirsiniz. Siz doğuştan bir girişimcisiniz, başkalarının kaçınmak için bahane ürettiği riskleri almaya istekli, toplantı odasındaki bir savaşçısınız. Profesyonel itibarınız dinamizm, hız ve şiddetli bağımsızlık üzerine kuruludur. Otorite figürleriyle mücadele edebilirsiniz çünkü derinlerde bir yerde, yetkili kişinin siz olmanız gerektiğine inanırsınız. En iyi işiniz, içgüdülerinize göre hareket etme özerkliğine sahip olduğunuzda ortaya çıkar. Liderlik, ordu, spor, cerrahi veya 'ilk hareket eden avantajının' her şey olduğu öncü teknoloji girişimlerinde kariyer arayın."
        },
        "Taurus": {
            "en": "A Taurus Midheaven suggests a career built on bedrock. You are the builder of the zodiac, seeking to create something lasting, tangible, and valuable. Your professional rise may be slow, but it is inexorable and incredibly stable. You thrive in industries that deal with resources, finance, beauty, or the earth itself. You have a golden touch for money and management, understanding the true value of things. Colleagues respect you for your reliability and your calm, unshakeable demeanor in crises. You are not driven by flashy trends but by quality and longevity. Your ultimate goal is to build an empire that provides security not just for yourself, but for generations to come. Sectors like banking, real estate, luxury goods, architecture, or agriculture are excellent fits.",
            "tr": "Boğa burcundaki Tepe Noktası, kaya gibi sağlam bir zemin üzerine inşa edilmiş bir kariyeri işaret eder. Siz zodyağın inşa edicisisiniz; kalıcı, somut ve değerli bir şey yaratmaya çalışıyorsunuz. Profesyonel yükselişiniz yavaş olabilir ama kaçınılmaz ve inanılmaz derecede istikrarlıdır. Kaynaklar, finans, güzellik veya dünyanın kendisiyle ilgili endüstrilerde gelişirsiniz. Para ve yönetim konusunda altın bir dokunuşunuz var, şeylerin gerçek değerini anlıyorsunuz. Meslektaşlarınız güvenilirliğinize ve kriz anlarındaki sakin, sarsılmaz tavrınıza saygı duyar. Gösterişli trendlerle değil, kalite ve uzun ömürlülükle hareket edersiniz. Nihai hedefiniz, sadece kendiniz için değil, gelecek nesiller için de güvenlik sağlayan bir imparatorluk kurmaktır. Bankacılık, gayrimenkul, lüks mallar, mimarlık veya tarım gibi sektörler mükemmel uyum sağlar."
        },
        "Gemini": {
            "en": "With a Gemini Midheaven, your career is a kaleidoscope of ideas, connections, and communications. You are the ultimate messenger. A standard 9-to-5 job with repetitive tasks is your personal hell; you need variety, intellectual stimulation, and the freedom to pursue multiple interests simultaneously. You are known for your versatility and your ability to talk your way into (and out of) anything. Your path involves bridging gaps—between people, industries, or concepts. You are a writer, a speaker, a marketer, or a trader. Your chaotic genius lies in seeing patterns that others miss. While some may call you inconsistent, you know that adaptability is the highest form of intelligence. Look for roles in media, journalism, public relations, coding, or any field that requires quick thinking and rapid adaptation.",
            "tr": "İkizler burcundaki Tepe Noktası ile kariyeriniz fikirlerin, bağlantıların ve iletişimlerin bir kaleydoskopudur. Siz nihai habercisiniz. Tekrarlayan görevleri olan standart bir 9-5 işi sizin kişisel cehenneminizdir; çeşitliliğe, entelektüel uyarılmaya ve aynı anda birden fazla ilgi alanını takip etme özgürlüğüne ihtiyacınız vardır. Çok yönlülüğünüz ve konuşarak her şeyi çözme (veya her şeyden sıyrılma) yeteneğinizle tanınırsınız. Yolunuz insanlar, endüstriler veya kavramlar arasındaki boşlukları doldurmayı içerir. Siz bir yazar, konuşmacı, pazarlamacı veya tüccarsınız. Kaotik dehanız, başkalarının kaçırdığı kalıpları görmekte yatar. Bazıları size tutarsız diyebilir, ancak siz uyum sağlama yeteneğinin zekanın en yüksek biçimi olduğunu biliyorsunuz. Medya, gazetecilik, halkla ilişkiler, kodlama veya hızlı düşünmeyi ve çabuk adaptasyonu gerektiren herhangi bir alanda rol arayın."
        },
        "Cancer": {
            "en": "A Cancer Midheaven indicates a career driven by intuition, care, and a desire to nurture. Even in the hardest corporate environment, you bring a sense of emotional intelligence and 'family' to your team. You act as the protector and the nourisher. Professional success for you is not just about status; it's about emotional fulfillment and security. You have an uncanny ability to read the public mood, making you excellent in marketing, HR, or public service. You may be drawn to professions involving food, housing, children, or healing. You lead not with an iron fist, but with empathy, creating loyalty that money cannot buy. Your challenge is developing a thick skin, as you tend to take professional setbacks personally.",
            "tr": "Yengeç burcundaki Tepe Noktası, sezgi, özen ve besleme arzusuyla yönlendirilen bir kariyeri işaret eder. En sert kurumsal ortamda bile, ekibinize duygusal zeka ve 'aile' hissi getirirsiniz. Koruyucu ve besleyici olarak hareket edersiniz. Sizin için profesyonel başarı sadece statü ile ilgili değildir; duygusal tatmin ve güvenlik ile ilgilidir. Halkın ruh halini okuma konusunda esrarengiz bir yeteneğiniz var, bu da sizi pazarlama, İK veya kamu hizmetinde mükemmel kılar. Yemek, barınma, çocuklar veya şifa içeren mesleklere çekilebilirsiniz. Demir yumrukla değil, empatiyle liderlik eder, paranın satın alamayacağı bir sadakat yaratırsınız. Zorluğunuz kalın bir deri geliştirmektir, çünkü profesyonel aksilikleri kişisel alma eğilimindesiniz."
        },
        "Leo": {
            "en": "With a Leo Midheaven, you were born to be seen. Your career is a stage, and you are the star. You possess natural authority, charisma, and a creative spark that demands expression. You are not meant to work behind the scenes; you need recognition and a role that allows your personality to shine. You are a benevolent leader, inspiring others through your confidence and warmth. Whether in entertainment, management, politics, or luxury branding, you bring a touch of royalty to whatever you do. Your professional brand is built on prestige and excellence. Be wary of ego traps, but never dim your light. You are here to demonstrate that work can be joyful, creative, and magnificent.",
            "tr": "Aslan burcundaki Tepe Noktası ile görülmek için doğdunuz. Kariyeriniz bir sahne ve siz yıldızsınız. Doğal bir otoriteye, karizmaya ve ifade talep eden yaratıcı bir kıvılcıma sahipsiniz. Sahne arkasında çalışmak için değil; tanınmaya ve kişiliğinizin parlamasına izin veren bir role ihtiyacınız var. Güveniniz ve sıcaklığınızla başkalarına ilham veren yardımsever bir lidersiniz. Eğlence, yönetim, politika veya lüks marka yönetiminde olsun, yaptığınız her şeye bir asalet dokunuşu getirirsiniz. Profesyonel markanız prestij ve mükemmellik üzerine kuruludur. Ego tuzaklarına karşı dikkatli olun ama ışığınızı asla söndürmeyin. İşin neşeli, yaratıcı ve muhteşem olabileceğini göstermek için buradasınız."
        },
        "Virgo": {
            "en": "A Virgo Midheaven signifies a career dedicated to mastery, precision, and service. You are the consummate professional. While others seek the spotlight, you seek perfection. You are the editor, the analyst, the healer, the one who makes systems work efficiently. Your eye for detail is legendary; nothing escapes you. You thrive in fields requiring high technical skill, research, medicine, or crafts. You are humble but indispensable; often, the entire operation rests on your organized shoulders. Your reputation is built on reliability, competence, and a critical intellect. Your challenge is avoiding burnout from perfectionism and learning to delegate. You find deep satisfaction in a job well done and leaving the world more orderly than you found it.",
            "tr": "Başak burcundaki Tepe Noktası, ustalığa, kesinliğe ve hizmete adanmış bir kariyeri işaret eder. Siz mükemmel bir profesyonelsiniz. Başkaları spot ışığını ararken, siz mükemmelliği ararsınız. Siz editör, analist, şifacı, sistemlerin verimli çalışmasını sağlayan kişisiniz. Detaylara olan gözünüz efsanevidir; hiçbir şey sizden kaçmaz. Yüksek teknik beceri, araştırma, tıp veya zanaat gerektiren alanlarda gelişirsiniz. Alçakgönüllü ama vazgeçilmezsiniz; genellikle tüm operasyon sizin düzenli omuzlarınızda durur. İtibarınız güvenilirlik, yetkinlik ve eleştirel bir zeka üzerine kuruludur. Zorluğunuz, mükemmeliyetçilikten kaynaklanan tükenmişlikten kaçınmak ve görev devretmeyi öğrenmektir. İyi yapılmış bir işten ve dünyayı bulduğunuzdan daha düzenli bırakmaktan derin bir tatmin duyarsınız."
        },
        "Libra": {
            "en": "With a Libra Midheaven, your career path is paved with diplomacy, aesthetics, and relationships. You are the face of the brand, the negotiator, the peacemaker. You thrive in roles that require balancing opposing viewpoints or creating beauty. Law, design, fashion, counseling, and public relations are your playgrounds. You have an innate sense of justice and fairness that guides your professional decisions. People engage with you because you make them feel heard and valued. Your charm is a potent professional tool. However, you may struggle with indecision or avoiding necessary conflicts. Your success comes from collaboration; you are often better with a partner than alone. You are here to bring grace and harmony to the professional world.",
            "tr": "Terazi burcundaki Tepe Noktası ile kariyer yolunuz diplomasi, estetik ve ilişkilerle döşelidir. Siz markanın yüzüsünüz, müzakerecisiniz, barış yapıcısınız. Karşıt görüşleri dengelemeyi veya güzellik yaratmayı gerektiren rollerde gelişirsiniz. Hukuk, tasarım, moda, danışmanlık ve halkla ilişkiler sizin oyun alanlarınızdır. Profesyonel kararlarınızı yönlendiren doğuştan gelen bir adalet ve hakkaniyet duygunuz vardır. İnsanlar sizinle etkileşime girer çünkü onları duyulmuş ve değerli hissettirirsiniz. Çekiciliğiniz güçlü bir profesyonel araçtır. Ancak, kararsızlıkla veya gerekli çatışmalardan kaçınmakla mücadele edebilirsiniz. Başarınız işbirliğinden gelir; genellikle bir ortakla yalnız olduğunuzdan daha iyisinizdir. Profesyonel dünyaya zarafet ve uyum getirmek için buradasınız."
        },
        "Scorpio": {
            "en": "A Scorpio Midheaven suggests a career of depth, power, and transformation. You are not interested in the superficial; you want to get to the root of things. You are a detective, a psychologist, a researcher, or a crisis manager. You thrive in high-stakes situations where others crumble. Your professional persona is intense, mysterious, and commanding. You understand power dynamics better than anyone and know how to leverage them. You are capable of immense focus and determination. Your career may involve managing other people's resources (talent or money) or dealing with taboo subjects (death, sex, trash). You are a master of reinvention; your career may go through several complete deaths and rebirths, each time rising higher.",
            "tr": "Akrep burcundaki Tepe Noktası, derinlik, güç ve dönüşüm dolu bir kariyeri işaret eder. Yüzeysel olanla ilgilenmiyorsunuz; olayların kökenine inmek istiyorsunuz. Siz bir dedektif, psikolog, araştırmacı veya kriz yöneticisisiniz. Başkalarının çöktüğü yüksek riskli durumlarda gelişirsiniz. Profesyonel kişiliğiniz yoğun, gizemli ve emredicidir. Güç dinamiklerini herkesten daha iyi anlıyor ve bunları nasıl kullanacağınızı biliyorsunuz. Muazzam bir odaklanma ve kararlılık kapasitesine sahipsiniz. Kariyeriniz, başkalarının kaynaklarını (yetenek veya para) yönetmeyi veya tabu konularla (ölüm, cinsellik, atık) ilgilenmeyi içerebilir. Yeniden icat etme ustasısınız; kariyeriniz birkaç tam ölüm ve yeniden doğuş yaşayabilir, her seferinde daha yükseğe çıkabilir."
        },
        "Sagittarius": {
            "en": "With a Sagittarius Midheaven, your career is a grand adventure. You need a profession that offers boundless horizons—physical, intellectual, or spiritual. You are the teacher, the philosopher, the traveler, the publisher. Routine is toxic to you. You thrive in roles that allow you to explore, preach, and inspire. Your optimism is infectious, and you are often seen as a visionary. You are drawn to international business, higher education, tourism, or law. You are here to synthesize wisdom and share it with the world. While you may lack attention to detail, you make up for it with your grasp of the big picture. Your career is not just a job; it's a calling, a quest for truth and meaning.",
            "tr": "Yay burcundaki Tepe Noktası ile kariyeriniz büyük bir maceradır. Sınırsız ufuklar sunan bir mesleğe ihtiyacınız var—fiziksel, entelektüel veya ruhsal. Siz öğretmensiniz, filozofsunuz, gezginsiniz, yayıncısınız. Rutin sizin için zehirlidir. Keşfetmenize, vaaz vermenize ve ilham vermenize izin veren rollerde gelişirsiniz. İyimserliğiniz bulaşıcıdır ve genellikle bir vizyoner olarak görülürsünüz. Uluslararası iş, yüksek öğrenim, turizm veya hukuka çekilirsiniz. Bilgeliği sentezlemek ve dünyayla paylaşmak için buradasınız. Detaylara dikkatiniz eksik olsa da, büyük resmi kavrayışınızla bunu telafi edersiniz. Kariyeriniz sadece bir iş değil; bir çağrı, bir gerçek ve anlam arayışıdır."
        },
        "Capricorn": {
            "en": "A Capricorn Midheaven is the signature of the CEO, the authority, the master of the material world. You approach your career with the seriousness of a general planning a campaign. You are ambitious, disciplined, and incredibly patient. You don't want quick success; you want enduring legacy. You understand structure and hierarchy, often climbing the corporate ladder to the very top. You thrive in government, corporate management, administration, or any field where rules and tangible results matter. You may feel the weight of responsibility heavily, but you bear it with dignity. Success often comes later in life, but it is solid and unshakeable. You are the one in charge.",
            "tr": "Oğlak burcundaki Tepe Noktası, CEO'nun, otoritenin, maddi dünyanın efendisinin imzasıdır. Kariyerinize bir sefer planlayan bir generalin ciddiyetiyle yaklaşırsınız. Hırslı, disiplinli ve inanılmaz derecede sabırlısınız. Hızlı başarı istemiyorsunuz; kalıcı bir miras istiyorsunuz. Yapıyı ve hiyerarşiyi anlıyorsunuz, genellikle kurumsal merdivenleri en tepeye tırmanıyorsunuz. Hükümet, kurumsal yönetim, idare veya kuralların ve somut sonuçların önemli olduğu herhangi bir alanda gelişirsiniz. Sorumluluğun ağırlığını ağır bir şekilde hissedebilirsiniz ama bunu onurla taşırsınız. Başarı genellikle hayatın ilerleyen dönemlerinde gelir, ancak sağlam ve sarsılmazdır. Yetkili kişi sizsiniz."
        },
        "Aquarius": {
            "en": "With an Aquarius Midheaven, your career must be unconventional, progressive, and future-oriented. You are the innovator, the rebel, the humanitarian. You cannot function within rigid, outdated systems; you are here to break them. You thrive in technology, science, social activism, or astrology. You view your work as a contribution to humanity’s evolution. You are often seen as eccentric or ahead of your time. You work best in flat hierarchies or as a freelancer where your intellect is free. You bring a detached, objective brilliance to your field. Your goal is not personal power, but liberation and progress for the collective. You are the architect of the future.",
            "tr": "Kova burcundaki Tepe Noktası ile kariyeriniz geleneksel olmayan, ilerici ve gelecek odaklı olmalıdır. Siz yenilikçisiniz, isyankarsınız, insancılsınız. Katı, modası geçmiş sistemler içinde işlev göremezsiniz; onları kırmak için buradasınız. Teknoloji, bilim, sosyal aktivizm veya astrolojide gelişirsiniz. İşinizi insanlığın evrimine bir katkı olarak görürsünüz. Genellikle eksantrik veya zamanının ötesinde görülürsünüz. En iyi düz hiyerarşilerde veya zekanızın özgür olduğu serbest çalışan bir kişi olarak çalışırsınız. Alanınıza mesafeli, objektif bir parlaklık getirirsiniz. Hedefiniz kişisel güç değil, kolektif için özgürleşme ve ilerlemedir. Siz geleceğin mimarısınız."
        },
        "Pisces": {
            "en": "A Pisces Midheaven suggests a career that is fluid, artistic, and spiritual. You are the dreamer, the artist, the mystic within the professional world. You bring compassion and imagination to your work. Hard, cold corporate environments drain your soul; you need work that connects to something higher or helps others heal. You thrive in the arts, music, film, healing professions, or charity work. Your 'brand' is elusive and glamorous, often projecting an image of allure or mystery. You rely on intuition rather than logic to make career moves. While you may struggle with practical details, your ability to tap into the collective unconscious allows you to create work that touches millions.",
            "tr": "Balık burcundaki Tepe Noktası, akışkan, sanatsal ve ruhsal bir kariyeri işaret eder. Siz profesyonel dünyadaki hayalperest, sanatçı, mistiksiniz. İşinize şefkat ve hayal gücü getirirsiniz. Sert, soğuk kurumsal ortamlar ruhunuzu tüketir; daha yüksek bir şeye bağlanan veya başkalarının iyileşmesine yardımcı olan bir işe ihtiyacınız vardır. Sanat, müzik, film, iyileştirme meslekleri veya hayır işlerinde gelişirsiniz. 'Markanız' yakalanması zor ve büyüleyicidir, genellikle bir cazibe veya gizem imajı yansıtır. Kariyer hamleleri yapmak için mantıktan çok sezgiye güvenirsiniz. Pratik detaylarla mücadele etseniz de, kolektif bilinçdışına dokunma yeteneğiniz milyonlara dokunan işler yaratmanıza olanak tanır."
        }
    },
    "saturn": {
        "fire": {
            "en": "Saturn in Fire signs (Aries, Leo, Sagittarius) creates a career discipline centered around managing inspiration and ego. Your challenge is patience. You want to lead and create immediately, but Saturn demands you earn your throne. You are learning to channel your immense creative energy into structured, long-term projects.",
            "tr": "Ateş burçlarındaki (Koç, Aslan, Yay) Satürn, ilham ve egoyu yönetme merkezli bir kariyer disiplini yaratır. Zorluğunuz sabırdır. Hemen liderlik etmek ve yaratmak istersiniz, ancak Satürn tahtınızı hak etmenizi talep eder. Muazzam yaratıcı enerjinizi yapılandırılmış, uzun vadeli projelere kanalize etmeyi öğreniyorsunuz."
        },
        "earth": {
            "en": "Saturn in Earth signs (Taurus, Virgo, Capricorn) is at home professionally. You have an innate understanding of how to build wealth and systems. Your challenge is avoiding excessive materialism or fear of poverty. You build slowly but surely, often becoming a titan of industry in later years.",
            "tr": "Toprak burçlarındaki (Boğa, Başak, Oğlak) Satürn, profesyonel olarak evindedir. Zenginlik ve sistemlerin nasıl inşa edileceğine dair doğuştan gelen bir anlayışa sahipsiniz. Zorluğunuz, aşırı materyalizmden veya yoksulluk korkusundan kaçınmaktır. Yavaş ama emin adımlarla inşa edersiniz, genellikle ilerleyen yıllarda endüstrinin devi olursunuz."
        },
        "air": {
            "en": "Saturn in Air signs (Gemini, Libra, Aquarius) disciplines the mind. Your career involves structuring ideas, networks, and communication. Your challenge is intellectual focus; stopping the mind from scattering. You are the architect of social systems and intellectual frameworks.",
            "tr": "Hava burçlarındaki (İkizler, Terazi, Kova) Satürn zihni disipline eder. Kariyeriniz fikirleri, ağları ve iletişimi yapılandırmayı içerir. Zorluğunuz entelektüel odaklanmadır; zihnin dağılmasını durdurmak. Sosyal sistemlerin ve entelektüel çerçevelerin mimarısınız."
        },
        "water": {
            "en": "Saturn in Water signs (Cancer, Scorpio, Pisces) brings structure to the emotional realm. Your career may involve psychology, healing, or managing crises. Your challenge is emotional resilience; not letting feelings drown your professional judgement. You turn empathy into a profession.",
            "tr": "Su burçlarındaki (Yengeç, Akrep, Balık) Satürn, duygusal aleme yapı getirir. Kariyeriniz psikoloji, şifa veya kriz yönetimi içerebilir. Zorluğunuz duygusal dayanıklılıktır; hislerin profesyonel yargınızı boğmasına izin vermemek. Empatiyi bir mesleğe dönüştürürsünüz."
        }
    },
    "monthly_transits": {
        "generic_forecast": {
            "en": "Cosmic Career Weather: The planets are currently shifting, activating new sectors of your professional chart. This month's energy favors strategic planning over impulsive action. Look to your network for opportunities, but rely on your own hard work to seal the deal. Jupiter offers expansion, but Saturn demands you check the details.",
            "tr": "Kozmik Kariyer Havası: Gezegenler şu anda değişiyor ve profesyonel haritanızın yeni sektörlerini harekete geçiriyor. Bu ayın enerjisi, dürtüsel eylem yerine stratejik planlamayı destekliyor. Fırsatlar için ağınıza bakın, ancak anlaşmayı mühürlemek için kendi sıkı çalışmanıza güvenin. Jüpiter genişleme sunuyor, ancak Satürn detayları kontrol etmenizi talep ediyor."
        }
    }
}